app/controllers/artists_controller.rb

  def show
    @artist = Artist.find(params[:format])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]